/*******************************************************************************
Выполнил: Тимошин Никита Владимирович.
Задание: Заполнение двумерного массива наполовину нулями
наполовину единицами по диагонали.
*******************************************************************************/
#include <stdio.h>

int main() {
  int i, j, k, M[10][10];
  k = -1; //задаю "счетчик строк"

  //Заполнение массива
  for (i = 0; i < 10; i++) // цикл по строкам
  {
    for (j = 0; j < 10; j++) // цикл по столбцам
    {
      M[i][j] = 1;
      if (k > -1)
        M[i][k] = 0;
      k++;
    }
    k -= 11;
  }
  // Вывод элементов массива
  for (i = 0; i < 10; i++) // цикл по строкам
  {
    for (j = 0; j < 10; j++) // цикл по столбцам
    {
      printf("[ %d ]\t ", M[i][j]);
    }
  }

  return 0;
}
