#include <malloc.h>
#include <stdio.h>
#include <stdlib.h>

int main() {
  int *N; // указатель на массив
  int i, j, n, Ch, a, b, c, d;
  int u = 1; //"Наполнение" улитки

  printf("Введите количество строк и столбцов N = ");
  scanf("%d", &n);
  // Выделение памяти
  N = (int *)malloc(n * n * sizeof(int));
  //Задаю необходимые параметры
  a = n; //Определние "краёв" матрицы (улитки)
  b = -1;
  c = 0;
  d = 1;
  Ch = 0; //Счетчик количества "поворотов" при заполнении матрицы

  // Заполнение "улитки"
  while (Ch < (n * 2)) {
    for (i = c, j = c; j < a; j++) //Обход слева-направо
    {
      *(N + i * n + j) = u;
      u++;
    }
    Ch++;
    if (Ch >= (n * 2) - 1)
      break;
    for (j = a - 1, i = d; i < a; i++) //Обход сверху-вниз
    {
      *(N + i * n + j) = u;
      u++;
    }
    Ch++;
    if (Ch >= (n * 2) - 1)
      break;
    for (j = j - 1, i = i - 1; j > b; j--) //Обход справа-налево
    {
      *(N + i * n + j) = u;
      u++;
    }
    Ch++;
    if (Ch >= (n * 2) - 1)
      break;
    for (j = j + 1, i = i - 1; i > c; i--) //Обход снизу-вверх
    {
      *(N + i * n + j) = u;
      u++;
    }
    Ch++;
    if (Ch >= (n * 2) - 1)
      break;
    a--;  //Изменяю значения "краёв" улитки что бы реализовать "закручивание внутрь"
    b++;
    c++;
    d++;
  }

  printf("j = %d\ni = %d\nCh = %d\n", j, i, Ch);

  // Вывод элементов массива
  for (i = 0; i < n; i++) // цикл по строкам
  {
    for (j = 0; j < n; j++) // цикл по столбцам
    {
      printf("[ %d ]\t ", *(N + i * n + j));
    }
    printf("\n");
  }
  free(N);

  return 0;
}
